/*# Задача 
# Cформировать случайным образом целочисленный массив A из натуральных двузначных чисел. 
Создать на его основе масив B, отбрасывая те, которые:
нарушают порядок возрастания
больше среднего арифметического элементов A
чётные




# Cформировать случайным образом целочисленный массив A из натуральных двузначных чисел. 
Создать на его основе масив B, отбрасывая те, которые:

больше среднего арифметического:
int [] arr = new int [A] {10,20,30,40,90,15,26,58,24}
number = new Random().Next (10,90);
int x = 0
if (number > x)
{
    тут нужно дописатьё
}
тут должен получиться список В
int [] arr = new int [B] {10,20,30,40,90,15,26,58,24}*/






