/*Почувствуй себя интерном
 0. Вывести квадрат числа
 1. По двум заданным числам проверять является ли первое квадратом второго
 2. Даны два числа. Показать большее и меньшее число
 3. По заданному номеру дня недели вывести его название
 4. Найти максимальное из трех чисел
 5. Написать программу вычисления значения функции y=f(a)
 6. Выяснить является ли число чётным
 7. Показать числа от -N до N
 8. Показать четные числа от 1 до N
 9. Показать последнюю цифру трёхзначного числа
10. Показать вторую цифру трёхзначного числа
11. Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
12. Удалить вторую цифру трёхзначного числа
13. Выяснить, кратно ли число заданному, если нет, вывести остаток.
14. Найти третью цифру числа или сообщить, что её нет*/

//0. Вывести квадрат числа
//int x = 2;
//int result=Math.Pow(x, 2);
//Console.WriteLine(result);

//1. По двум заданным числам проверять является ли первое квадратом второго
/*int x = 4;
int y = 2;
if (y*y==x)
{
   Console.WriteLine("ok");
}
else
{
    Console.WriteLine("not ok");
}*/

//2. Даны два числа. Показать большее и меньшее число
/*
int a = 2;
int b = 4;
int min = 0;
int max = 0;
if (a<b)
{
min = a;
max = b;
Console.WriteLine(min, max);
}
else
{
min = b;
max = a;
} 
Console.WriteLine(min, max);
*/

//3. По заданному номеру дня недели вывести его название
/*
int day = 1;
string zadanie(int day)
string s = String.Empty
{
if (day == 1) return 'понедельник';
if (day == 2) return 'вторник  ';
if (day == 3) return 'среда';
if (day == 4) return 'четверг';
if (day == 5) return 'пятница';
if (day == 6) return 'суббота';
if (day == 7) return 'воскресенье';
}
else s = "день задан неверно"
Console.WriteLine(s);*/


 //4. Найти максимальное из трех чисел
/*
int number1=1;
int number2=2;
int number3=3;
int max =  number1;
if (number2>max) max = number2;
if (number3>max) max = number3;
Console.WriteLine(max);*/

/* //5. Написать программу вычисления значения функции y=f(a)

 int y( int a);
 {
return a*a*a;
 }
 int c = y(2)
 Console.WriteLine(c);*/

 //6. Выяснить является ли число чётным
 /*int number = 201;
 if(number % 2 == 0)
{
  Console.WriteLine("четное");
}
else
{
    Console.WriteLine("не четное");
}*/

/*//7. Показать числа от -N до N
int N = 5;
for (int i = -N; i <= N; i++)
{
    Console.WriteLine(i);
}*/
/*

//8. Показать четные числа от 1 до N
int N = 26;
for (int i = 1; i <= N; i++)
{
    if (i % 17 == 0) //if (i % 17 != 0) - 
    Console.WriteLine(i);
}*/

/*//9. Показать последнюю цифру трёхзначного числа
 int number= 213;
 string text = Convert.ToString(number);
 Console.WriteLine (text[2]);*/

//10. Показать вторую цифру трёхзначного числа
/*
int number= 212;
 string text = Convert.ToString(number);
 Console.WriteLine (text[1]);*/

//Сделать репозиторий

